{
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",

  "hidden_size": 2048,
  "num_hidden_layers": 24,
  "num_attention_heads": 16,
  "num_key_value_heads": 16,
  "intermediate_size": 5504,
  "hidden_act": "silu",
  "max_position_embeddings": 4096,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-6,
  "initializer_range": 0.02,
  "vocab_size": 102400,
  "tie_word_embeddings": false,
  "bos_token_id": 100000,
  "eos_token_id": 100001,
  "torch_dtype": "bfloat16",
  "use_cache": false
}
